In [9]:
import pandas as pd

In [ ]:
#series-> one dimensional data structure
#it is homogenous data type preferences is present
#size immutable datastructure

In [ ]:
#data frames->2d data structure 
#it is size mutable

In [25]:
seris = pd.Series([21,13,35,43])
seris

0    21
1    13
2    35
3    43
dtype: int64

In [17]:
seris.dtype

dtype('int64')

In [ ]:
seris.name("names")

In [18]:
#indexing
seris[0]

np.int64(2)

In [20]:
#iloc-> inbuilt indexing function
seris.iloc[3]

np.int64(4)

In [23]:
seris.iloc[[1,3]]

1    1
3    4
dtype: int64

In [2]:
index = ['apple', 'grapes','mango','orange']
seris.index =index
seris

NameError: name 'seris' is not defined

In [1]:
 #label based indexing -> in label based indexing
# the start and stop are included in the output

import pandas as pd
x =10
print (x)

In [5]:
import pandas as pd
#lamda functions
x = lambda y: y*2
x(3)

6

In [2]:
#dictionary
data = {
    'Category': ['Electronics', 'Apparel', 'Electronics', 'Apparel', 'Electronics', 'Books'],
    'Product': ['Laptop', 'T-shirt', 'Smartphone', 'Jeans', 'Headphones', 'Novel'],
    'Sales': [1200, 50, 800, 75, 150, 20]
}

In [10]:
df = pd.DataFrame(data)
df

      Category     Product  Sales
0  Electronics      Laptop   1200
1      Apparel     T-shirt     50
2  Electronics  Smartphone    800
3      Apparel       Jeans     75
4  Electronics  Headphones    150
5        Books       Novel     20

In [11]:
 df.head()

      Category     Product  Sales
0  Electronics      Laptop   1200
1      Apparel     T-shirt     50
2  Electronics  Smartphone    800
3      Apparel       Jeans     75
4  Electronics  Headphones    150

In [16]:
df.loc[0:3, 'Category':'Product']

      Category     Product
0  Electronics      Laptop
1      Apparel     T-shirt
2  Electronics  Smartphone
3      Apparel       Jeans

In [20]:
df [['Product']]

      Product
0      Laptop
1     T-shirt
2  Smartphone
3       Jeans
4  Headphones
5       Novel

In [21]:
 df.dropna()

      Category     Product  Sales
0  Electronics      Laptop   1200
1      Apparel     T-shirt     50
2  Electronics  Smartphone    800
3      Apparel       Jeans     75
4  Electronics  Headphones    150
5        Books       Novel     20

In [28]:
df.drop('Product',axis = 1, inplace =True)

In [30]:
df = pd.DataFrame(data)

In [35]:
df.drop('Product',axis =1, inplace = False) #inplace has to do with
#changing the original dataset

      Category  Sales
0  Electronics   1200
1      Apparel     50
2  Electronics    800
3      Apparel     75
4  Electronics    150
5        Books     20

In [39]:
df.shape

(6, 3)

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Category  6 non-null      object
 1   Product   6 non-null      object
 2   Sales     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [43]:
df.describe() 
#this describes the value section of yourr dataset

             Sales
count     6.000000
mean    382.500000
std     496.626117
min      20.000000
25%      56.250000
50%     112.500000
75%     637.500000
max    1200.000000

In [45]:
df['Sales']= df['Sales'] + 50
df

      Category     Product  Sales
0  Electronics      Laptop   1300
1      Apparel     T-shirt    150
2  Electronics  Smartphone    900
3      Apparel       Jeans    175
4  Electronics  Headphones    250
5        Books       Novel    120

In [49]:
#renaming columns.
df.rename(columns = {"Sales": "No of Sales"}, inplace = True)
df

      Category     Product  No of Sales
0  Electronics      Laptop         1300
1      Apparel     T-shirt          150
2  Electronics  Smartphone          900
3      Apparel       Jeans          175
4  Electronics  Headphones          250
5        Books       Novel          120

In [50]:
df['Category'].unique()

array(['Electronics', 'Apparel', 'Books'], dtype=object)

In [55]:
df['Category'].value_counts()
#check the number of counts for each element

Category
Electronics    3
Apparel        2
Books          1
Name: count, dtype: int64

In [58]:
#creating new columns
df['Vendors'] = df['No of Sales']//10
df

      Category     Product  No of Sales  Vendors
0  Electronics      Laptop         1300      130
1      Apparel     T-shirt          150       15
2  Electronics  Smartphone          900       90
3      Apparel       Jeans          175       17
4  Electronics  Headphones          250       25
5        Books       Novel          120       12

In [59]:
#dealing with null values
#dropping null values
df.dropna()

      Category     Product  No of Sales  Vendors
0  Electronics      Laptop         1300      130
1      Apparel     T-shirt          150       15
2  Electronics  Smartphone          900       90
3      Apparel       Jeans          175       17
4  Electronics  Headphones          250       25
5        Books       Novel          120       12

In [ ]:
df.dropna(how ='any') 
# this drops null values for rowa that had any null values

In [ ]:
df.dropna (how = 'all')
# this drops null values inly if all the values
#on that row is 0

In [60]:
#this fills null values with a value
df.fillna()

      Category     Product  No of Sales  Vendors
0  Electronics      Laptop         1300      130
1      Apparel     T-shirt          150       15
2  Electronics  Smartphone          900       90
3      Apparel       Jeans          175       17
4  Electronics  Headphones          250       25
5        Books       Novel          120       12

In [62]:
df['Vendors'] = df.fillna(df['Vendors'].mean(),inplace =True)

In [69]:
#this is correct
df['Category'].fillna(method='ffill', inplace =False)
df

C:\Users\pc\AppData\Local\Temp\ipykernel_23156\4275983853.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Category'].fillna(method='ffill', inplace =False)

      Category     Product  No of Sales Vendors
0  Electronics      Laptop         1300    None
1      Apparel     T-shirt          150    None
2  Electronics  Smartphone          900    None
3      Apparel       Jeans          175    None
4  Electronics  Headphones          250    None
5        Books       Novel          120    None

In [71]:
#replacing data
df['Product'].replace('Jeans', 'Cargo-Pants', inplace = True)
df

C:\Users\pc\AppData\Local\Temp\ipykernel_23156\1087053487.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Product'].replace('Jeans', 'Cargo-Pants', inplace = True)

      Category      Product  No of Sales Vendors
0  Electronics       Laptop         1300    None
1      Apparel      T-shirt          150    None
2  Electronics   Smartphone          900    None
3      Apparel  Cargo-Pants          175    None
4  Electronics   Headphones          250    None
5        Books        Novel          120    None

In [81]:
#dealing with dublicate values
df_dup = df[df.duplicated()] # shows  the duplicated data set
df_dup

Empty DataFrame
Columns: [Category, Product, No of Sales, Vendors]
Index: []

In [82]:
#dealing with invalid values
df['No of Sales']=df['No of Sales'].apply(lambda x: x*2 if x<150 else x )
df['No of Sales']

0    1300
1     150
2     900
3     175
4     250
5     240
Name: No of Sales, dtype: int64

In [3]:
import pandas as pd
meds = pd.read_csv('medical.csv')

In [11]:
meds['smoker'].replace (['yes','no'],[1,0], inplace = True)

C:\Users\pc\AppData\Local\Temp\ipykernel_20280\2687105715.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  meds['smoker'].replace (['yes','no'],[1,0], inplace = True)
C:\Users\pc\AppData\Local\Temp\ipykernel_20280\2687105715.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  meds['smoker'].replace (['yes','no'],[1,0], inplace = True)

In [12]:
meds

      age     sex     bmi  children  smoker     region      charges
0      19  female  27.900         0       1  southwest  16884.92400
1      18    male  33.770         1       0  southeast   1725.55230
2      28    male  33.000         3       0  southeast   4449.46200
3      33    male  22.705         0       0  northwest  21984.47061
4      32    male  28.880         0       0  northwest   3866.85520
...   ...     ...     ...       ...     ...        ...          ...
1333   50    male  30.970         3       0  northwest  10600.54830
1334   18  female  31.920         0       0  northeast   2205.98080
1335   18  female  36.850         0       0  southeast   1629.83350
1336   21  female  25.800         0       0  southwest   2007.94500
1337   61  female  29.070         0       1  northwest  29141.36030

[1338 rows x 7 columns]